Repository: GamemakerChina/GMS2_manual_en2ch
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Draw the surface in the Draw GUI event of an instance, since the GUI layer is independent of views.
zh_cn: 既然GUI层是独立出视野的，那么可以在一个实例的GUI事件中绘制表面。

source: Draw thin selection outline
zh_cn: 绘制细的选区轮廓

source: Draw this instance's sprite.
zh_cn: 绘制该实例绑定的精灵。

source: Drawing
zh_cn: 绘制

source: Drop here to add child
zh_cn: 拖到此处以添加子级

source: Drop here to assign parent
zh_cn: 拖到此处以分配父级

source: Drop here to assign resource
zh_cn: 拖拽到此处以分配资源

source: Drop here to assign sprite
zh_cn: 拖拽到这里指定精灵

source: Due to iOS submission requirement changes, Options > iOS > Icons image sizes are now different and your current icons need to be recreated at the correct sizes.
zh_cn: 由于iOS提交要求更改，Options> iOS>Icons 的图像大小现在有所不同，您当前的图标需要以正确的大小重新创建。

source: Duplicate
zh_cn: 复制

source: Duplicate Event
zh_cn: 复制事件

source: Duplicate Layer
zh_cn: 复制层

source: Duplicate layer(s)
zh_cn: 复制层

source: Duplicate style '{0}' found, it will be discarded as overwrite is set to false
zh_cn: 找到重复样式“{0}”，当覆盖（overwrite）设置为false时，它将被丢弃

source: Duplicate the current line (or multiple lines if they have been selected)
zh_cn: 复制当前行（或者选中的多行）

source: Duplicate the selected event
zh_cn: 复制所选事件

source: Duplicate the selected moment
zh_cn: 复制所选时刻

source: ERROR:
zh_cn: 错误：

source: ERROR: Project failed to compile: error code {0}
zh_cn: 错误：项目编译失败：错误代码 {0}

source: ERROR: Project failed to deploy: error code {0}
zh_cn: 错误：项目部署失败。错误代码 {0}

source: ERROR: Project failed to run: error code {0}
zh_cn: 错误：项目运行失败：错误代码{0}

source: ERROR: Unable to extract '{0}' at '{1}'
zh_cn: 错误：无法在'{1}'中提取 '{0}'

source: ERROR: {0} - {1}: {2}
zh_cn: 错误：{0} - {1}: {2}

source: Each 1 or 0 represents a single bit of data, and as you can see this means that in binary, 10 equals 2!
zh_cn: 每个 1 或 0 代表一个单个 位 数据，“10” 等于 2！

source: Each bit is 2 times the previous value with the first bit being equal to 1.
zh_cn: 首位等于1，每一位 是之前值的 2 倍。

source: Each entry has a number of sub-entries to permit you to define exactly how each separate piece of text should look, as shown in the example image above.
zh_cn: 每个条目都有一些子条目，以便您可以准确的定义每个单独的文本应如何显示，如上面示例图所示。

source: Each of the console targets comes with two compile options, one is the VM that uses a runner and interpreted code and the other which is the YYC (YoYo Compiler) which creates native code and a compiled executable.
zh_cn: 每个控制台目标平台都有两个编译选项，一个是使用运行器和解释代码的VM（虚拟机），另一个是创建本机代码和编译可执行文件的YYC（YoYo编译器）。

source: Each of the different windows has the same set of options, which are listed below:
zh_cn: 每一个不同的窗口都共有相同的一组选项，列举如下：

source: Each of these flags will change the behaviour of your fixture in the following ways:
zh_cn: 这些标志中的每一个将通过以下方式改变您的灯具的行为：

source: Each release of GameMaker Studio 2 comes with it's own set of release notes.
zh_cn: 每个版本的GameMaker Studio 2 都会有它自己的一套发行信息。

source: Each section of this window is explained below:
zh_cn: 此窗口的各部分详细解释如下：

source: Each target option saves to a platform specific format, listed below:
zh_cn: 每个目标选项都会保存为特定于平台的格式，如下所示：

source: Each target platform can have one or more output formats, the main ones being:
zh_cn: 每个目标平台可以有一个或多个输出格式，主要格式有：

source: Easy, we shift everything left by 2, rather than one.
zh_cn: 很简单，我们把每一位都左移 2 位，而不是 1位。

source: Easy.
zh_cn: 很简单。

source: Edge
zh_cn: 边缘

source: Edge Filtering
zh_cn: 边缘过滤

source: Edit
zh_cn: 编辑

source: Edit Action
zh_cn: 编辑动作

source: Edit All
zh_cn: 全部编辑

source: Edit Amazon Fire Devices
zh_cn: 编辑 Amazon Fire 设备

source: Edit Android Devices
zh_cn: 编辑 Android 设备

source: Edit Autotiling
zh_cn: 编辑自动图块

source: Edit Collision Mask
zh_cn: 编辑碰撞遮罩

source: Edit Context Menu
zh_cn: 编辑上下文菜单

source: Edit HTML5 Browsers
zh_cn: 编辑 HTML5 浏览器

source: Edit Image
zh_cn: 编辑图像

source: Edit Language
zh_cn: 编辑语言

source: Edit Linux Devices
zh_cn: 编辑 Linux 设备

source: Edit Mac Devices
zh_cn: 编辑 Mac 设备

source: Edit Mask
zh_cn: 编辑遮罩

source: Edit Menu
zh_cn: 编辑菜单

source: Edit Object
zh_cn: 编辑物体

source: Edit PS Vita Devices
zh_cn: 编辑 PS Vita 设备

source: Edit PS3 Devices
zh_cn: 编辑 PS3 设备

source: Edit PS4 Devices
zh_cn: 编辑 PS4 设备

source: Edit Parent
zh_cn: 编辑父项

source: Edit Point {0} In {1}
zh_cn: 在{1}中编辑点{0}

source: Edit Points
zh_cn: 编辑点

source: Edit Sound
zh_cn: 编辑声音

source: Edit Sprite
zh_cn: 编辑精灵

source: Edit Tile Animation
zh_cn: 编辑图块动画

source: Edit Tile Inheritance (I)
zh_cn: 编辑图块继承(I)

source: Edit Windows Devices
zh_cn: 编辑 Windows 设备

source: Edit Windows Phone 8 Devices
zh_cn: 编辑 Windows Phone 8 设备

source: Edit Xbox One Devices
zh_cn: 编辑 Xbox One 设备

source: Edit all selected moments
zh_cn: 编辑所有被选定的时刻

source: Edit iOS Devices
zh_cn: 编辑 iOS 设备

source: Edit layer properties
zh_cn: 编辑层属性

source: Edit tvOS Devices
zh_cn: 编辑 tvOS 设备

source: Edit...
zh_cn: 编辑...

source: Editing Mode:
zh_cn: 编辑模式：

source: Editor background colour
zh_cn: 编辑器背景颜色

source: Editors:
zh_cn: 编辑器：

source: Editors: The Object Editor
zh_cn: 编辑器：物体编辑器

source: Education
zh_cn: 教育

source: Effects
zh_cn: 效果

source: Either option will open a file explorer window where you can give the final name that you wish to use for your game package before clicking Save to start the compile and build process.
zh_cn: 以上选项将打开一个文件浏览器窗口，您可以在单击 保存 以启动编译和构建过程之前，给出希望用于游戏包的最终名称。

source: Ellipse
zh_cn: 椭圆

source: Ellipse (Slow)
zh_cn: 椭圆 (慢)

source: Ellipse Tool
zh_cn: 椭圆工具（Ellipse Tool）

source: Ellipse select tool
zh_cn: 椭圆选择工具

source: Ellipse tool
zh_cn: 椭圆工具

source: Ellipse tool - filled
zh_cn: 椭圆工具 - 填充

source: Ellipse tool - outline
zh_cn: 椭圆工具 - 轮廓

source: Else
zh_cn: 否则

source: Email
zh_cn: 电子邮箱

source: Email to commit as
zh_cn: 用于提交的邮箱

source: Email/Username
zh_cn: 电子邮箱/用户名

source: Emergency
zh_cn: 应急

source: Emit Particles
zh_cn: 发射粒子

source: Emit particles from a particle system.
zh_cn: 从一个粒子系统中发射粒子。

source: Emitter
zh_cn: 发射器

source: Empty
zh_cn: 空

source: Enable
zh_cn: 启用

source: Enable ACCESS_NETWORK_STATE permission
zh_cn: 启用 ACCESS_NETWORK_STATE（访问网络状态） 权限

source: Enable Advertising
zh_cn: 启用广告

source: Enable Amazon APIs
zh_cn: 启用亚马逊 API

source: Enable BLUETOOTH permission
zh_cn: 启用 BLUETOOTH（蓝牙）权限

source: Enable Bluetooth/iCade Support
zh_cn: 启用 蓝牙/iCade 支持

source: Enable Bluetooth/iCade support
zh_cn: 启用蓝牙/ iCade支持

source: Enable Code Completion
zh_cn: 启用代码自动补全

source: Enable Colour Coding
zh_cn: 允许颜色编码

source: Enable Context Menu
zh_cn: 启用上下文菜单

source: Enable DPI Override
zh_cn: 启用DPI改写

source: Enable DPI override
zh_cn: 启用DPI改写

source: Enable Fast Collisions
zh_cn: 启用快速碰撞

source: Enable File Access Logging to SD Card
zh_cn: 启用文件访问记录到 SD 卡

source: Enable Flurry Analytics
zh_cn: 开启 Flurry 分析

source: Enable Front Touch
zh_cn: 应用前部触摸（Front Touch）

source: Enable Google Analytics
zh_cn: 开启谷歌分析

source: Enable Google Cloud Saving
zh_cn: 启用谷歌云存储

source: Enable Google Cloud saving
zh_cn: 启用谷歌云保存

source: Enable Google Licensing
zh_cn: 启用谷歌许可证

source: Enable Google Services
zh_cn: 启用谷歌服务

source: Enable Google licensing
zh_cn: 启用谷歌许可证

source: Enable Haptic Effects
zh_cn: 使用触觉（Haptic）效果

source: Enable IAP Sandbox
zh_cn: 启用 IAP沙盒

source: Enable IAP sandbox
zh_cn: 应用 IAP 沙盒

source: Enable ID_CAP_MICROPHONE permission
zh_cn: 启用 ID_CAP_MICROPHONE（麦克风） 权限

source: Enable INTERNET permission
zh_cn: 启用 INTERNET （互联网）权限

source: Enable MICROPHONE permission
zh_cn: 启用 MICROPHONE （耳麦）权限

source: Enable MOGA Gamepad Support
zh_cn: 启用MOGA游戏手柄

source: Enable MOGA gamepad support
zh_cn: 启用MOGA游戏手柄支持

source: Enable NX CPU Profiler for YYC Builds
zh_cn: 为 YYC 构建启用 NX CPU Profiler

source: Enable Notification messages
zh_cn: 启用消息通知

source: Enable Physics
zh_cn: 启用物理

source: Enable Push Notifications
zh_cn: 启用推送通知

source: Enable Push Notificiations
zh_cn: 启用通知推送

source: Enable READ_PHONE_STATE permission
zh_cn: 启用 READ_PHONE_STATE（读取通话状态） 权限

source: Enable RECORD_AUDIO permission
zh_cn: 启用 RECORD_AUDIO （录音）权限

source: Enable Rear Touch
zh_cn: 应用后部触摸（Rear Touch）

source: Enable Retina
zh_cn: 启用Retina

source: Enable SEARCH permission
zh_cn: 启用 SEARCH （搜索）许可

source: Enable Short Circuit Evaluations
zh_cn: 启用短路求值

source: Enable Source Control
zh_cn: 启用源码控制

source: Enable Steam
zh_cn: 启用 Steam

source: Enable Viewports
zh_cn: 启用视口

source: Enable WRITE_EXTERNAL_STORAGE permission
zh_cn: 启用 WRITE_EXTERNAL_STORAGE（写入外部存储） 权限

source: Enable Xbox Live
zh_cn: 启用 Xbox Live

source: Enable a new view and draw the surface only in that view (using view_current to check which view is being drawn)
zh_cn: 启用一个新的视野，在新视野中绘制表面（使用 view_current 检测正在绘制哪个视野）。

source: Enable adding brackets to functions
zh_cn: 启用函数添加括号

source: Enable code completion
zh_cn: 启用代码自动补全

source: Enable colour coding
zh_cn: 启用彩色代码（语法高亮）

source: Enable in game
zh_cn: 在游戏中启用

source: Enable mask overlay for point insertion
zh_cn: 为点插入启用蒙版覆盖

source: Enable notifications
zh_cn: 启用消息通知

source: Enable push notifications
zh_cn: 启用推送通知

source: Enable real-time debugging
zh_cn: 应用实时调试

source: Enable source control
zh_cn: 启用源码控制

source: Enable steam
zh_cn: 应用 steam

source: Enable support for NEX libraries
zh_cn: 启用对NEX库的支持

source: End
zh_cn: 结束

source: End Step
zh_cn: 步结束

source: End User License Agreement: (EULA)
zh_cn: 最终用户许可协议：(EULA)

source: End of search results reached, should we loop?
zh_cn: 搜索结果到达末尾，我们应该循环吗？

source: Engine Code
zh_cn: 引擎代码

source: Ensure alpha level is increased to display node highlight
zh_cn: 要查看高亮节点，请确保增加了alpha等级。

source: Enter
zh_cn: 回车（Enter）

source: Enter Debugger Connection String
zh_cn: 输入调试器连接字符串

source: Enter framework path on Mac
zh_cn: 输入Mac上的框架路径

source: Enter new certificate details:
zh_cn: 输入新的证书的详细信息︰

source: Entires for injecting into the Android Manifest Activity
zh_cn: 用于注入Android清单活动（Android Manifest Activity）的入口

source: Entries for injecting into the Android Manifest Activity
zh_cn: 注入Android Manifest Activity的条目

source: Entries for injecting into the Android Manifest Application
zh_cn: 注入Android Manifest应用程序的条目

source: Entries for injecting into the Android Manifest file
zh_cn: 注入Android Manifest文件的条目

source: Entries for injecting into the Gradle build system
zh_cn: 注入Gradle构建系统的条目

source: Enum
zh_cn: 枚举

source: Enum Entries
zh_cn: 枚举项

source: Enum Field
zh_cn: 枚举字段

source: Enum Input
zh_cn: 枚举输入

source: Enums
zh_cn: 枚举

source: Enums are global scope variables (this is implicit, and they require no "global" suffix) and they have the following structure:
zh_cn: 枚举具有全局作用域（这是隐式的，而且不需要global前缀）并且它们具有如下结构：

source: Environment Variables
zh_cn: 环境变量

source: Equal
zh_cn: 等于

source: Equivalent Code
zh_cn: 等价代码

source: Erase tool
zh_cn: 橡皮擦工具

source: Eraser (E)
zh_cn: 橡皮擦(E)

source: Error
zh_cn: 错误

source: Error ({0}) - {1}
zh_cn: 错误 ({0}) - {1}

source: Error - function '{0}' in extension '{1}' has more than 4 arguments, and they are not all of the same type
zh_cn: 错误 - 扩展名“{1}”中的函数“{0}”具有4个以上的参数，并且它们的类型不一致

source: Error -- Cannot show preview.
zh_cn: 错误 -- 不能显示预览。

source: Error Acquiring Demo: {0}
zh_cn: 获取Demo出错：{0}

source: Error Opening Externally
zh_cn: 外部打开错误

source: Error Reporting
zh_cn: 错误报告

source: Error Selecting Image
zh_cn: 选择图像出错

source: Error acquiring tutorial: {0}
zh_cn: 获取教程时出错：{0}

source: Error creating package
zh_cn: 创建程序包时出错

source: Error extracting package archive: {0}
zh_cn: 提取程序包文档错误： {0}

source: Error importing package
zh_cn: 导入程序包时出错

source: Error installing tutorial
zh_cn: 安装教程报错：

source: Error line colour
zh_cn: 报错行颜色

source: Error loading tutorial file: {0}
zh_cn: 加载教程文件时报错：{0}

source: Error proxy must using "http://address:port" format
zh_cn: 错误代理：必须使用 "http://address:port" 格式

source: Error with Keystore
zh_cn: 密钥库错误

source: Error with Runtime
zh_cn: 运行库错误

source: Error with addon
zh_cn: 附加组件出错

source: Error: Invalid proxy setting
zh_cn: 错误： 代理设置无效

source: Error: variable '{0}' has same name as a built-in (function, constant or variable), it must be renamed to function correctly
zh_cn: 错误： 变量'{0}'已经具有同名的内置名称（函数、常量或变量），必须重命名以修正

source: Error: {0}
zh_cn: 错误: {0}

source: Errors creating session
zh_cn: 创建会话错误

source: Escape
zh_cn: 退出（Escape）

source: Essentially they save the current configuration of the different game options and export options for the resource tree, meaning you can have a specific configuration for Android, another for Windows, etc....
zh_cn: 本质上，它们保存了资源树的不同游戏选项和导出选项的配置，这意味着您可以对 Android 平台进行特定配置，而另一种用于 Windows 平台等。

source: Essentially, When you're scrolling in window "A", the cursor might hover over another scrollable area in window "B", so this preference defines how long you have to wait after you stop scrolling "A" before you can then scroll "B", so you don't accidentally start scrolling different panels.
zh_cn: 必要地，当你滚动窗口“A”时，光标可能会悬停在另一个可滚动的窗口“B”的部分区域上，因此这个设置定义了在你停止滚动“A”窗口之后需要多长时间你才能滚动“B”窗口，这样你就不会不小心地滚动到别的面板了。

source: Essentially, a tile is simply a graphical resource that gets drawn to the screen with very little CPU/GPU overhead, making them ideal for designing any static items in levels, and a tile set is a collection of tiles created together in one sprite.
zh_cn: 从本质上讲，图块只是一个简单的图形资源，只需要很少的 CPU / GPU 运算就可以绘制到屏幕上，这使得它们成为设计制作所有静态项目的理想选择，图块集 是在一个精灵中统一创建的图块的集合。

source: Evaluate
zh_cn: 求值

source: Evaluate all selected actions
zh_cn: 计算所有被选择的动作

source: Evaluate...
zh_cn: 求值

source: Evaluation Order
zh_cn: 求值顺序

source: Evaluation Result
zh_cn: 求值结果

source: Event
zh_cn: 事件

source: Event Description
zh_cn: 事件描述

source: Event Editor
zh_cn: 事件编辑器

source: Event Name
zh_cn: 事件名称

source: Event Tabs
zh_cn: 事件标签页

source: Event label format (unchecked items are shown in the tooltip)
zh_cn: 事件标签格式（未选中的项显示在工具提示中）

source: Events
zh_cn: 事件

source: Everything
zh_cn: 一切

source: Exactly the same as we would use a normal variable, as shown by the following examples:
zh_cn: 确切的说，和普通的变量没有区别， 请看下面的例子：

source: Example
zh_cn: 举例

source: Example :
zh_cn: 例子：

source: Example Of Target
zh_cn: 目标变量样例

source: Example:
zh_cn: 举例：

source: Examples
zh_cn: 举例

source: Examples of use:
zh_cn: 使用的例子：

source: Excellent
zh_cn: 优异

source: Exception - {0}
zh_cn: 异常 - {0}

source: Exception in {0},{1} : {2}
zh_cn: 在 {0},{1}中的例外 : {2}

source: Exception while converting {0} : {1}
zh_cn: 转换{0}时出现异常：{1}

source: Exception while parsing {0}
zh_cn: 解析{0}异常

source: Exclude Self
zh_cn: 排除自己

source: Executable Name
zh_cn: 可执行文件名称

source: Execute Action Script Using Code
zh_cn: 使用代码执行动作脚本

source: Execute Code
zh_cn: 执行代码

source: Execute Script
zh_cn: 执行脚本

source: Execute a piece of code.
zh_cn: 执行一段代码。

source: Execute a script resource.
zh_cn: 执行一个脚本资源。

source: Execute code in the context of a specific object or instance.
zh_cn: 在特定物体或实例的上下文中执行代码。

source: Execute code while a given expression is true.
zh_cn: 当给定的表达式为真执行其中代码。

source: Exit
zh_cn: 退出

source: Exit Game
zh_cn: 退出游戏

source: Exit the IDE
zh_cn: 退出IDE

source: Exit the current event without executing the remaining code.
zh_cn: 不再执行后续代码并跳出该事件。

source: Exit the game application.
zh_cn: 退出游戏程序。

source: Expand / Collapse all active docks in the workspace (manually contracted docks will not expand)
zh_cn: 展开/折叠工作区中的所有停靠栏

source: Expand / Collapse all docks in the workspace
zh_cn: 展开/折叠工作区内所有停靠栏

source: Expand / Contract the bottom dock
zh_cn: 展开/折叠底部停靠栏

source: Expand / Contract the left dock
zh_cn: 展开/折叠左侧停靠栏

source: Expand / Contract the right dock
zh_cn: 展开/折叠右侧停靠栏

source: Expand All
zh_cn: 全部展开

source: Expand Localisation
zh_cn: 展开本地化

source: Expand or collapse
zh_cn: 展开或折叠

source: Expand/Collapse All
zh_cn: 全部展开/折叠

source: Expandable Category
zh_cn: 可扩展分类

source: Expected Symbols / Values
zh_cn: 期望符号 / 值

source: Explore
zh_cn: 探索

source: Explosion
zh_cn: 爆炸

source: Export
zh_cn: 导出

source: Export Library
zh_cn: 导出库

source: Export Project
zh_cn: 导出项目

source: Export Sprite Disabled
zh_cn: 禁止导出精灵

source: Export the current project as a YYZ file
zh_cn: 将当前工程保存为YYZ文件

source: Export to PNG
zh_cn: 导出 PNG

source: Exporting library failed.
zh_cn: 导出库失败。

source: Exporting...
zh_cn: 导出中...

source: Expression
zh_cn: 表达式

source: Expression:
zh_cn: 表达式：

source: Expressions
zh_cn: 表达式

source: Extended Example
zh_cn: 扩展示例

source: Extended Example:
zh_cn: Extended 举例：

source: Extension Android Properties
zh_cn: Android 扩展属性

source: Extension Editor
zh_cn: 扩展编辑器

source: Extension Editor Preferences
zh_cn: 扩展包编辑器的偏好设置

source: Extension Error
zh_cn: 扩展错误

source: Extension Properties - Export
zh_cn: 扩展属性 - 导出

source: Extension Properties - Import
zh_cn: 扩展属性 - 导入

source: Extension file already exists
zh_cn: 扩展文件已经存在

source: Extension iOS Properties
zh_cn: iOS 扩展属性

source: Extension resource names clash with project resources.
zh_cn: 扩展资源名称与项目资源冲突。

source: Extension resources:
zh_cn: 扩展资源：

source: Extension tvOS Properties
zh_cn: tvOS 扩展属性

source: Extension with name '{0}' already exists - delete previous version before importing new version
zh_cn: 扩展 '{0}' 已经存在 - 导入新版本之前删除之前的版本

source: Extension:
zh_cn: 扩展：

source: Extension: {0}
zh_cn: 扩展：{0}

source: Extensions
zh_cn: 扩展

source: Extensions Label Colour
zh_cn: 扩展标签颜色

source: Extensions are additional files and code that you can add to extend the GameMaker Studio 2 functionality as well as add assets to your game from the Marketplace.
zh_cn: 扩展是您可以添加的附加文件和代码，以扩展 GameMaker Studio 2 的功能，以及从 Marketplace 向游戏添加资源。

source: Extensions background colour
zh_cn: 扩展背景颜色

source: Extensions icon colour
zh_cn: 扩展图标颜色

source: Extensions with more than 4 arguments on DLL types must all have the same argument type.\n{0}
zh_cn: DLL类型上包含4个以上参数的扩展必须具有相同的参数类型。\n{0}

source: External Editors
zh_cn: 外部编辑器

source: External Name:
zh_cn: 外部名：

source: External Project File Error
zh_cn: 外部项目文件错误

source: Extra Platforms
zh_cn: 附加平台

source: Extracting...
zh_cn: 提取中...

source: Extras
zh_cn: 其它

source: FONTS
zh_cn: 字体函数

source: FPS:
zh_cn: 帧率(FPS):

source: Facebook App ID
zh_cn: Facebook 应用 ID

source: Facebook App Id
zh_cn: Facebook 应用 Id

source: Facebook App Name
zh_cn: Facebook 应用名称

source: Failed bracket/quote match colour
zh_cn: 括号引号匹配失败的颜色

source: Failed to clone style value object of type '{0}' collection types must have a bespoke deep clone implemented
zh_cn: 无法克隆类型为“{0}”的样式值对象，集合类型必须实现定制的深度克隆

source: Failed to clone style value object of type '{0}' object class must implement ICloneable interface
zh_cn: 无法复制类型为“{0}”的样式值对象，对象类必须实现ICloneable接口

# Failed to connect to the remote worker. Verify the host name and try again.
source: Failed to connect to the remote worker.\nVerify the host name and try again.
zh_cn: 无法连接到远程工作者。\n验证主机名，然后重试。

source: Failed to create certificate file: {0}
zh_cn: 创建证书文件失败： {0}

source: Failed to evaluate expression
zh_cn: 表达式求值失败

source: Failed to expand localisation
zh_cn: 无法扩展本地化

source: Failed to extract the extension archive: '{0}'
zh_cn: 无法提取扩展档案： '{0}'

source: Failed to find any tutorials in the installed package
zh_cn: 无法在已安装的程序包中找到任何教程

source: Failed to import YYZ
zh_cn: 导入YYZ失败

source: Failed to import the chosen files.
zh_cn: 选中的文件导入失败。

source: Failed to install tutorial package '{0}'
zh_cn: 未能安装教程包'{0}'

source: Failed to load a required plug-in
zh_cn: 无法加载所需插件。

source: Failed to load a required plug-in.
zh_cn: 无法加载所需的插件。

source: Failed to load layout '{0}' from file '{1}' as it has a duplicate name
zh_cn: 从文件'{1}'载入布局 '{0}' 失败，因为有重名布局

source: Failed to open document for edit: {0} - {1}
zh_cn: 未能打开编辑的文档：{0} - {1}

source: Failed to open external editor {0}.
zh_cn: 无法打开外部编辑器：{0}。

source: Failed to parse enum of type '{1}' using the value '{2}' - exception message: '{0}'
zh_cn: 无法使用值“{2}”解析类型为“{1}”的枚举 - 异常消息：“{0}”

source: Failed to save licence file {0} - no result
zh_cn: 无法保存证书文件 {0} - 无结果

source: Failed to save licence file {0} - result {1}({2})
zh_cn: 无法保存证书文件 {0} - 结果值 {1}({2})

source: Failed to set layer name '{0}' it is not unique within room
zh_cn: 无法设置层名称“{0}”，它在房间内不是唯一的

source: Failed to set property on model '{0}' name is not unique
zh_cn: 无法在模型'{0}'中设置属性，名称非唯一

source: Failed to store undo property '{0}': \nMultiple potential properties found, does this property use the 'new' keyword?
zh_cn: 无法存储撤消属性“{0}”：\n找到多个潜在属性，此属性是否使用“新”关键字？

source: Failed to verify the package
zh_cn: 验证程序包失败

# Failed with error: '{0}'
source: Failed with error:\n'{0}'
zh_cn: 失败因为错误：\n'{0}'

source: Fast
zh_cn: 快速

source: Fatal Error
zh_cn: 严重错误

source: Favourites
zh_cn: 喜爱

source: Feedback Survey
zh_cn: 反馈调查

source: Fetching images...
zh_cn: 正在取得图像……

source: File
zh_cn: 文件

source: File Data Invalid
zh_cn: 文件数据无效

source: File Directory Not Found
zh_cn: 文件目录未找到

source: File Handling
zh_cn: 文件处理

source: File Inaccessible
zh_cn: 文件无法访问

source: File Input
zh_cn: 文件输入

source: File Load Cancelled
zh_cn: 取消文件载入

source: File Load Timeout
zh_cn: 文件载入超时

source: File Locked
zh_cn: 文件已锁定

source: File Menu
zh_cn: 文件菜单

source: File Name
zh_cn: 文件名

source: File Name:
zh_cn: 文件名：

source: File Not Found
zh_cn: 文件未找到

source: File Path Too Long
zh_cn: 文件路径过长

source: File Size:
zh_cn: 文件大小：

source: File System Save Areas
zh_cn: 文件系统存储区域

source: File already exists
zh_cn: 文件已经存在

source: File associations
zh_cn: 文件关联

source: File name:
zh_cn: 文件名：

source: File path is too long: {0}
zh_cn: 文件路径太长： {0}

source: File watcher frequency (ms)
zh_cn: 文件观察频率(毫秒)

source: File watcher frequency in milliseconds
zh_cn: 文件监视频率（毫秒）

source: File watcher frequency in milliseconds on laptops
zh_cn: 笔记本上的文件监视频率（毫秒）

source: Filename
zh_cn: 文件名

source: Files
zh_cn: 文件

source: Files Modified in Commit - {0}
zh_cn: 提交中修改的文件 - {0}

source: Files Modified in Selected Commit
zh_cn: 选定的提交中被修改的文件?

source: Fill
zh_cn: 填充

source: Fill (F)
zh_cn: 填充(F)

source: Fill tool
zh_cn: 填充工具

source: Filter Tree
zh_cn: 过滤树（Filter Tree）

source: Filter by installed
zh_cn: 按已安装过滤

source: Filtered
zh_cn: 滤过

source: Filters:
zh_cn: 过滤器：

source: Final Function:
zh_cn: 终结函数：

source: Finally it clears the old grid so that all cells have a value of -1.
zh_cn: 最终清空旧栅格以便所有单元格都承载值-1.

source: Finally the surface is assigned to a view.
zh_cn: 最后，给这个表面图层指定给一个视野。

source: Finally there are three extra options that can flagged as on or off for your fixture, Sensor, Start Awake and Kinematic.
zh_cn: 最后，有三个额外的选项可以标记为打开或关闭您的夹具，传感器，启动唤醒和运动。

source: Finally you can assign the values to an array using a single variable call like this:
zh_cn: 最后，您可以使用单个变量调用将值分配给数组，如下所示：:

source: Finally you can use parenting to "mix and match" events and behaviours.
zh_cn: 最后，您可以使用父处理来“混合搭配”事件和行为。

source: Finally you have the Go to option which will open the following window:
zh_cn: 最后的 Go to 选项将打开以下窗口：

source: Finally you have the option to open Tutorial Windows.
zh_cn: 最后你还有一个打开 教程窗口 的选项。

source: Finally, after setting those up you have one last option:
zh_cn: 最后一个选项：

source: Finally, if the total force is greater than 2, the joint is deleted.
zh_cn: 最后，如果关节合力大于2，则该关节会删除失效。

source: Finally, parenting works when you refer to variables in other objects too, like in the above monster example if I set the enemy 1 speed to 10, then the enemy 2 speed will also go to ten as it is a child object of enemy 1.
zh_cn: 最后，如果将敌人的1速度设置为10，敌人的2速度也将变为10，因为它是敌人1的小孩对象，所以在您参考其他对象中的变量时，父母也可以工作。

source: Finally, you can reset the GUI layer using this function by setting the scaling factors to -1.
zh_cn: 最后，你可以尝试将将缩放因数设置为-1，重置GUI层。

source: Find All
zh_cn: 查找全部

source: Find Next
zh_cn: 查找下一个

source: Find Previous
zh_cn: 查找上一个

source: Find Resource
zh_cn: 查找资源

source: Find and Replace
zh_cn: 查找和替换

source: Find everything you need in one place.
zh_cn: 无需踏破铁鞋即可得来全不费功夫。

source: Find the overlapping region of the rectangle defined by (x1,y1) to (x2,y2) on each of the attached displays.
zh_cn: 查找 (x1,y1) 到 (x2,y2)矩形范围内的每个附加显示器的重叠区域。

source: Find...
zh_cn: 查找...

source: Finished
zh_cn: 已完成

source: Finished files
zh_cn: 已完成文件

source: Firework
zh_cn: 烟花

source: First the expression is executed.
zh_cn: 首先括号里面的运行表达式
